src/Documents/ОперацияКошелька/ОперацияКошелька.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияКошелька</name>
  <registerRecords>AccumulationRegister.КошелькиПерсонажей</registerRecords>
  <attributes>
    <name>Персонаж</name>
    <type>
      <types>CatalogRef.Персонажи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийКошелька</types>
    </type>
  </attributes>
  <attributes>
    <name>PP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгроваяМинута</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.СущностиКампании</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/КошелькиПерсонажей/КошелькиПерсонажей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КошелькиПерсонажей</name>
  <resources>
    <name>PP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>GP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>EP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>SP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>CP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Персонаж</name>
    <type>
      <types>CatalogRef.Персонажи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ВидыОперацийКошелька/ВидыОперацийКошелька.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийКошелька</name>
  <enumValues>
    <name>Доход</name>
  </enumValues>
  <enumValues>
    <name>ДенежныйРасход</name>
  </enumValues>
  <enumValues>
    <name>МатериальныйРасход</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ОперацияКошелька/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Обработчик события ПередЗаписью документа ОперацияКошелька.
// При создании нового документа автоматически заполняет реквизит ИгроваяМинута
// текущим игровым временем активной кампании. Если время не инициализировано,
// реквизит остаётся пустым.
//
// Параметры:
//  Отказ - Булево - признак отказа от записи.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;

	Если ИгроваяМинута <> 0 Тогда
		Возврат;
	КонецЕсли;

	Попытка
		ТекущееВремя = ИгровоеВремя.ПолучитьТекущееВремя();
	Исключение
		Возврат;
	КонецПопытки;

	Если ТекущееВремя = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИгроваяМинута = ТекущееВремя;

КонецПроцедуры

// Обработчик события ОбработкаПроведения документа ОперацияКошелька.
//
// Выполняемые проверки:
//  - Персонаж заполнен и принадлежит активной кампании;
//  - ВидОперации заполнен;
//  - для обычных операций количество монет неотрицательное;
//  - операция содержит хотя бы одну ненулевую сумму;
//  - Контрагент, если заполнен, принадлежит активной кампании.
//
// При проведении формируются движения регистра накопления КошелькиПерсонажей,
// отражающие фактическое изменение физического кошелька (с учётом авторазмена
// для ДенежныйРасход).
//
// Параметры:
//  Отказ         - Булево - признак отказа от проведения.
//  РежимПроведения - РежимПроведенияДокумента
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Ошибки = Неопределено;

	ПроверитьЗаполнениеРеквизитов(Ошибки);
	ПроверитьПринадлежностьКампании(Ошибки);

	Если Ошибки <> Неопределено И Ошибки.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		Возврат;
	КонецЕсли;

	СтоимостьДо = КошелекПерсонажа.ПолучитьСтоимостьВCP(Персонаж);
	Остаток = КошелекПерсонажа.ПолучитьОстаток(Персонаж);

	Изменение = РассчитатьИзменение(Остаток, СтоимостьДо, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ЗаписатьДвижения(Изменение);

КонецПроцедуры

// Обработчик события ОбработкаУдаленияПроведения.
// Очищает движения документа по регистру КошелькиПерсонажей.
//
// Параметры:
//  Отказ - Булево
//
Процедура ОбработкаУдаленияПроведения(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет обязательные реквизиты шапки документа и состав сумм.
// Формирует массив ошибок, если они есть.
//
// Параметры:
//  Ошибки - Структура - контейнер ошибок (пополняется).
//
Процедура ПроверитьЗаполнениеРеквизитов(Ошибки)

	Если НЕ ЗначениеЗаполнено(Персонаж) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"Объект.Персонаж",
			НСтр("ru = 'Не заполнен персонаж.'"),
			"");
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"Объект.ВидОперации",
			НСтр("ru = 'Не заполнен вид операции.'"),
			"");
	КонецЕсли;

	ЭтоКорректировка = (ВидОперации = Перечисления.ВидыОперацийКошелька.Корректировка);

	Если НЕ ЭтоКорректировка Тогда
		ДобавитьОшибкуОтрицательногоКоличества(Ошибки, "PP", PP);
		ДобавитьОшибкуОтрицательногоКоличества(Ошибки, "GP", GP);
		ДобавитьОшибкуОтрицательногоКоличества(Ошибки, "EP", EP);
		ДобавитьОшибкуОтрицательногоКоличества(Ошибки, "SP", SP);
		ДобавитьОшибкуОтрицательногоКоличества(Ошибки, "CP", CP);
	КонецЕсли;

	ВсеСуммыНулевые = (PP = 0) И (GP = 0) И (EP = 0) И (SP = 0) И (CP = 0);
	Если ВсеСуммыНулевые Тогда
		ТекстОшибки = НСтр("ru = 'Укажите хотя бы одну ненулевую сумму.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"Объект",
			ТекстОшибки,
			"");
	КонецЕсли;

КонецПроцедуры

// Проверяет принадлежность Персонажа и Контрагента активной кампании.
//
// Параметры:
//  Ошибки - Структура - контейнер ошибок.
//
Процедура ПроверитьПринадлежностьКампании(Ошибки)

	АктивнаяКампания = ПараметрыСеанса.АктивнаяКампания;
	Если НЕ ЗначениеЗаполнено(АктивнаяКампания) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
			"Объект",
			НСтр("ru = 'Не задана активная кампания.'"),
			"");
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Персонаж) Тогда
		КампанияПерсонажа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Персонаж, "Владелец");
		Если КампанияПерсонажа <> АктивнаяКампания Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.Персонаж",
				НСтр("ru = 'Персонаж не принадлежит активной кампании.'"),
				"");
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Контрагент) Тогда
		//@skip-check bsl-legacy-check-string-literal
		КампанияКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Владелец");
		Если КампанияКонтрагента <> АктивнаяКампания Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.Контрагент",
				НСтр("ru = 'Контрагент не принадлежит активной кампании.'"),
				"");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьОшибкуОтрицательногоКоличества(Ошибки, ИмяНоминала, Количество)

	Если Количество >= 0 Тогда
		Возврат;
	КонецЕсли;

	ШаблонОшибки = НСтр("ru = 'Количество монет %1 не может быть отрицательным для выбранного вида операции.'");
	ТекстОшибки = СтрШаблон(ШаблонОшибки, ИмяНоминала);
	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
		"Объект." + ИмяНоминала,
		ТекстОшибки,
		"");

КонецПроцедуры

// Возвращает изменение физического кошелька по виду операции.
//
// Параметры:
//  Остаток      - Структура - текущий физический остаток.
//  СтоимостьДо  - Число - стоимость кошелька до операции.
//  Отказ        - Булево - флаг отказа от проведения (устанавливается в Истина при ошибке).
//
// Возвращаемое значение:
//  Структура - итоговое изменение кошелька с ключами PP, GP, EP, SP, CP.
//
Функция РассчитатьИзменение(Остаток, СтоимостьДо, Отказ)

	Если ВидОперации = Перечисления.ВидыОперацийКошелька.Доход Тогда
		Возврат ИзменениеДоход();

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКошелька.ДенежныйРасход Тогда
		Возврат ИзменениеДенежныйРасход(Остаток, СтоимостьДо, Отказ);

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКошелька.МатериальныйРасход Тогда
		Возврат ИзменениеМатериальныйРасход(Остаток, Отказ);

	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийКошелька.Корректировка Тогда
		Возврат ИзменениеКорректировка(Остаток, Отказ);

	Иначе
		Отказ = Истина;
		Возврат НовыйНаборМонет();
	КонецЕсли;

КонецФункции

Функция ИзменениеДоход()

	Результат = НовыйНаборМонет();
	Результат.PP = PP;
	Результат.GP = GP;
	Результат.EP = EP;
	Результат.SP = SP;
	Результат.CP = CP;
	Возврат Результат;

КонецФункции

Функция ИзменениеДенежныйРасход(Остаток, СтоимостьДо, Отказ)

	Попытка
		Изменение = КошелекПерсонажа.РассчитатьДенежныйРасход(Остаток, PP, GP, EP, SP, CP);
	Исключение
		Отказ = Истина;
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ОписаниеОшибки();
		СообщениеПользователю.Поле = "Объект";
		СообщениеПользователю.Сообщить();
		Возврат НовыйНаборМонет();
	КонецПопытки;

	СтоимостьИзменения = КошелекПерсонажа.СтоимостьВCP(
		Изменение.PP, Изменение.GP, Изменение.EP, Изменение.SP, Изменение.CP);

	СтоимостьРасхода = КошелекПерсонажа.СтоимостьВCP(PP, GP, EP, SP, CP);
	СтоимостьПосле = СтоимостьДо + СтоимостьИзменения;

	Если СтоимостьПосле <> СтоимостьДо - СтоимостьРасхода Тогда
		Отказ = Истина;
		ШаблонОшибки = НСтр("ru = 'Ошибка авторазмена: после операции %1 CP, ожидалось %2 CP.'");
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = СтрШаблон(ШаблонОшибки, СтоимостьПосле, СтоимостьДо - СтоимостьРасхода);
		СообщениеПользователю.Поле = "Объект";
		СообщениеПользователю.Сообщить();
		Возврат НовыйНаборМонет();
	КонецЕсли;

	Возврат Изменение;

КонецФункции

Функция ИзменениеМатериальныйРасход(Остаток, Отказ)

	Попытка
		КошелекПерсонажа.ПроверитьМатериальныйРасход(Остаток, PP, GP, EP, SP, CP);
	Исключение
		Отказ = Истина;
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = ОписаниеОшибки();
		СообщениеПользователю.Поле = "Объект";
		СообщениеПользователю.Сообщить();
		Возврат НовыйНаборМонет();
	КонецПопытки;

	Результат = НовыйНаборМонет();
	Результат.PP = -PP;
	Результат.GP = -GP;
	Результат.EP = -EP;
	Результат.SP = -SP;
	Результат.CP = -CP;
	Возврат Результат;

КонецФункции

Функция ИзменениеКорректировка(Остаток, Отказ)

	Результат = НовыйНаборМонет();
	Результат.PP = PP;
	Результат.GP = GP;
	Результат.EP = EP;
	Результат.SP = SP;
	Результат.CP = CP;

	Для Каждого КлючИЗначение Из Результат Цикл
		НовыйОстаток = Остаток[КлючИЗначение.Ключ] + КлючИЗначение.Значение;
		Если НовыйОстаток < 0 Тогда
			Отказ = Истина;
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = СтрШаблон(
				НСтр("ru = 'Корректировка приведёт к отрицательному остатку %1: текущий остаток %2, изменение %3.'"),
				КлючИЗначение.Ключ,
				Остаток[КлючИЗначение.Ключ],
				КлючИЗначение.Значение);
			СообщениеПользователю.Поле = "Объект." + КлючИЗначение.Ключ;
			СообщениеПользователю.Сообщить();
			Возврат НовыйНаборМонет();
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Записывает движения регистра накопления КошелькиПерсонажей по рассчитанному
// изменению. Каждый номинал с ненулевым изменением формирует отдельную запись.
// Вид движения (Приход/Расход) выбирается по знаку изменения.
//
// Параметры:
//  Изменение - Структура - итоговое изменение с ключами PP, GP, EP, SP, CP.
//
Процедура ЗаписатьДвижения(Изменение)

	Движения.КошелькиПерсонажей.Записывать = Истина;

	Для Каждого КлючИЗначение Из Изменение Цикл
		ЗначениеИзменения = КлючИЗначение.Значение;
		Если ЗначениеИзменения = 0 Тогда
			Продолжить;
		КонецЕсли;

		Запись = Движения.КошелькиПерсонажей.Добавить();
		Запись.Персонаж = Персонаж;

		Если ЗначениеИзменения > 0 Тогда
			Запись.ВидДвижения = ВидДвиженияНакопления.Приход;
			Запись[КлючИЗначение.Ключ] = ЗначениеИзменения;
		Иначе
			Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
			Запись[КлючИЗначение.Ключ] = -ЗначениеИзменения;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция НовыйНаборМонет()

	Набор = Новый Структура;
	Набор.Вставить("PP", 0);
	Набор.Вставить("GP", 0);
	Набор.Вставить("EP", 0);
	Набор.Вставить("SP", 0);
	Набор.Вставить("CP", 0);
	Возврат Набор;

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
